# 1 Найти сумму чисел списка стоящих на нечетной позиции
# Пример:[1,2,3,4] -> 4

from random import randint

def in_list(n, frst, last):
    return [randint(frst, last) for i in range(n)]

def sum_pos(mylist):
    return sum(mylist[1::2])

n = 10
frst = 1
last = 10

mylist = in_list(n, frst, last)
print(mylist)
print(sum_pos(mylist))



# 2 Найти произведение пар чисел в списке. Парой считаем первый и последний элемент, 
# второй и предпоследний и т.д. 
# Пример: [2, 3, 4, 5, 6] => [12, 15, 16]; [2, 3, 5, 6] => [12, 15] 

from random import randint
import math

def get_numbers(n, frst, last):
    return [randint(frst, last) for i in range(n)]

def mult_pairs(mylist):
    return [mylist[i] * mylist[-i - 1] for i in range(math.ceil(len(mylist)/2))]

n = 9
first = 1
last = 10

mylist = get_numbers(n, first, last)
print(mylist)
print(mult_pairs(mylist))

# 3 В заданном списке вещественных чисел найдите 
# разницу между максимальным и минимальным значением дробной части элементов. 
# Пример: [1.1, 1.2, 3.1, 5, 10.01] => 0.19

from random import uniform

def get_real_nums (n, frst, last):
    return [round(uniform(frst,last), 2) for i in range(n)]

def find_diff(mynums):
    nums = [round(x - int(x), 2) for x in (mynums)]
    return max(nums) - min(nums)

n = 5
frst = 1
last = 10
mynums = get_real_nums(n, frst, last)

print (mynums)
print(find_diff(mynums))

# 4 Написать программу преобразования десятичного числа в двоичное

n = int(input('Введите число: '))

def conv_dec_to_bin(n):
    bin_num = ''
    while n > 1:
        bin_num += str(n % 2)
        n = n // 2
    return bin_num[::-1]

print(conv_dec_to_bin(n))


